---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedShapeBuilderTarget.AnyGeometry
enum: Autodesk.Revit.DB.TessellatedShapeBuilderTarget
source: html/c445e799-cb1d-a4cb-5333-719f5c19df18.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderTarget.AnyGeometry

A Geometry, which depending on input data can be a Solid or a 'sheet',
 where there is no fully enclosed volume formed by the generated faces.